{
  "overview": ["# constellations\n\nConstellations is a proof of concept that reimagines social media as a platform that emphasizes connection and community – not popularity metrics, mindless consumption, or superficial comparisons. For millenia, we have looked up at the stars for spiritual and directional guidance. We have a natural inclination to make connections amongst ourselves as did the ancient navigators and astronomers when they defined the constellations. As the world becomes more driven by social media and algorithms, our social lives are prone to lacking the authenticity, sponteneity, and care necessary for fulfilling relationships. \n\nSocial media platforms are driven by likes, view counts, and user retention metrics for the purpose of maximzing ad revenue. The focus is on content consumption, regardless of whether the content is excessively negative, manipulative, inauthentic, or otherwise lacking in deeper meaning. In trying something new, Constellations seeks to make the aspect of building connections – defining constellations amongst ourselves – its primary feature. Rather than focusing on likes, follower counts, or encouraging you to scroll through an infinite amount of addictive content, Constellations focuses on the quality of the connections you make with your friends, family, and community. Your connections grow naturally the more you interact with posts, comments, and reactions. The night sky is accessible to all, but some stars are dimmer than others. To discover new connections, use the _telescope_ feature.\n\nConstellations in the night sky are defined not by the number of connections between constiutent stars but by their quality. Some constellations are just a few stars small and yet they inpsire generations of storytelling. These authentic and enduring relationships are what social media should help faciliate.\n\n### Design\n\n#### Primary Elements\n\n- Stars represent individual users\n- Brightness indicates activity level\n- Size could show experience/contribution level\n- Position remains relatively stable to maintain recognizable patterns\n- Posts appear as smaller light points around the user's star\n- Like a soft glow or aura around their star\n- Recent content appears brighter\n\n#### Connections & Clusters\n\n- Lines between stars show direct connections\n- Natural clusters form around shared interests\n- The intensity of interaction brightens the connecting lines\n- New connections appear as gradual brightening paths\n- Groups appear as recognizable patterns of stars\n\n#### Interface Elements\n\n- Home view shows your star and closest connections\n- Zoom out reveals broader patterns and communities\n- Navigation feels like panning across a star field\n- Search could highlight relevant stars/patterns\n- Activity feed shows \"brightening\" in your visible area\n\n\n### Initial Experience:\n\n#### Guided Introduction\n\n- New users start in a \"nursery nebula\" - a distinct area for newcomers\n- Their star begins dim but visible\n- Brief tutorial shows how to navigate the space\n- Quick interest/background survey helps with initial positioning\n- Shows a few example constellations they might want to join\n\n#### Early Navigation\n\n- System highlights \"nearby\" stars with similar interests\n- Shows active constellations they might enjoy\n- Provides \"telescope\" search functionality to find specific users/topics\n- Offers \"constellation guides\" - curated paths through different interest areas\n- Early interactions create temporary \"light trails\" to encourage exploration\n\nLyra is built with React + TS\n\n"]
}
